
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        4 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                           |
|:--------:|:------------------------------------|
|    🟢    | `aws_iam_access_key.ha`             |
|    🟢    | `aws_iam_policy.ha-permissions`     |
|    🟢    | `aws_iam_user.ha`                   |
|    🟢    | `aws_iam_user_policy_attachment.ha` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.ha will be created
  + resource "aws_iam_access_key" "ha" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "home-assitant"
    }

  # aws_iam_policy.ha-permissions will be created
  + resource "aws_iam_policy" "ha-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for Home Assistant"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ha-permissions-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "route53:*"
                      + Effect   = "Allow"
                      + Resource = "Z06678433LQB8HDM1I8R"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # aws_iam_user.ha will be created
  + resource "aws_iam_user" "ha" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "home-assitant"
      + path          = "/"
      + tags_all      = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.ha will be created
  + resource "aws_iam_user_policy_attachment" "ha" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "home-assitant"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDQsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==
```
</details>